app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def search_by_director
    @movies = Movie.find_movies_by_director(params[:id])
    if @movies == []
      flash[:notice] = "'#{Movie.find(params[:id]).title}' has no director info"